seed/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


//  The dimensionless variables are: Pe = U0*l/D0, Da = k0*l/U0

D0  D0 [0  2 -1 0 0 0 0 ] 1e-1;         // Dimensioned diff
k0  k0 [0  0 -1 0 0 0 0 ] 1e-1;         // Dimensioned rate
 
// ************************************************************************* //
